Revit 2027 API
IPerformanceAdviserRule.GetElementFilter Method
 Retrieves a filter to restrict elements to be checked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
ElementFilter GetElementFilter(
	Document document
)
Function GetElementFilter (
	document As Document
) As ElementFilter
ElementFilter^ GetElementFilter(
	Document^ document
)
abstract GetElementFilter :
        document : Document -> ElementFilter
Parameters
document Document
 Document for which performance problems are being checked.
Return Value
ElementFilter
 The filter to restrict elements to be checked.
Remarks
 If the rule needs to be executed on individual elements, it should return a filter that defines what elements the rule should apply to. Otherwise, nothing (i.e. null) should be returned. If filter is returned, it should stay valid till the end of the check.
See Also
Reference
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace